tutorials/mixingTransportFoam/twoStreamsEQMOM/constant/mixingProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      mixingProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mixingModel turbulentMixing;

turbulentMixingCoeffs
{
    diffusionModel
    {
        mixingDiffusionModel  turbulentDiffusion;
        gammaLam    gammaLam [ 0 2 -1 0 0 0 0 ] 1.0e-6;
        Sc    0.7;
    }

    mixing on;

    mixingKernel
    {
        Cphi          Cphi  [ 0 0 0 0 0 0 0 ] 2.0;
        c             c     [ 0 0 0 0 0 0 0 ] 1.0;
        mixingKernel  IEM;
    }

    odeCoeffs
    {
        ATol    1.0e-8;
        RTol    1.0e-4;
        fac     0.9;
        facMin  0.5;
        facMax  2.0;
        minLocalDt 1.0e-5;
    }
}

// ************************************************************************* //
